@echo off
title Запуск мессенджера Доверие
color 06

echo ========================================
echo   ЗАПУСК СТАНЦИИ "ДОВЕРИЕ"
echo ========================================

:: Проверка, установлены ли модули
if not exist node_modules (
    echo [!] Библиотеки не найдены. Устанавливаю Express...
    call npm install express
)

:: Запуск браузера через 2 секунды (чтобы сервер успел прогреться)
start "" "http://localhost:8080"

:: Запуск самого сервера
echo [OK] Сервер поднимается на порту 8080...
node server.js

pause